Revit 2027 API
FormatOptions.IsValidAccuracy(Double) Method
 Checks whether an accuracy is valid for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidAccuracy(
	double accuracy
)
Public Function IsValidAccuracy (
	accuracy As Double
) As Boolean
public:
bool IsValidAccuracy(
	double accuracy
)
member IsValidAccuracy :
        accuracy : float -> bool
Parameters
accuracy Double
 The accuracy to check.
Return Value
Boolean
 True if the accuracy is valid, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
Remarks
 See the Accuracy property for details on valid accuracy values.
See Also
Reference
FormatOptions Class
IsValidAccuracy Overload
Autodesk.Revit.DB Namespace